Destruction AllStars
2021
Lucid Games 
2 February 2021
platform: " playstation 4 , playstation 5 , PC , XBOX X ,XBOX S",
The game is a vehicular combat game in which players need to seek ways to destroy the vehicles of the opponents. AllStars can also eject from their vehicles, whether it be voluntarily or upon destruction.
vehicular combat game
$19.99

