Avatar Frontiers of Pandora
2024
Massive Entertainment
December 7, 2023
platform: " playstation 4 , playstation 5 , PC , XBOX X ,XBOX S",
description: Avatar: Frontiers of Pandora™ is a first-person, action-adventure game set in the open world of the never-before-seen Western Frontier of Pandora. Abducted by the human militaristic corporation known as the RDA, you, a Na'vi, were trained and molded to serve their purpose.

first-person, action-adventure game
$69.99