Lies of P
23
Neowiz Games and Round8 Studio

release_date: September 19, 2023
platform: " playstation 4 , playstation 5 , PC , XBOX X ,XBOX S",

What is Lies of P? A dark fantasy action game inspired by the classic story of Pinocchio. This macabre Soulslike draws its inspiration from an unlikely source: The Adventures of Pinocchio.

 dark fantasy action game

$59.99 