Returnal
2023
Housemarque 
platform: " playstation 4 , playstation 5 , PC , XBOX X ,XBOX S",

In Returnal, the players take on the role of Selene, a Deep-Space-Astro-Scout, who crashes with her spaceship on a planet called Atropos. On Atropos, Selene must face the horrors of a time loop that re-awakes her in the same place every time she dies.

third-person shooter 

$36.39
