Armored Core VI Fires of Rubicon
2023
FromSoftware
August 25, 2023
platform: " playstation 4 , playstation 5 , PC , XBOX X ,XBOX S",

The gameplay in Armored Core VI emphasizes mecha-based vehicular combat. Players in this game take on the role of expert pilots in control of strong mechs known as Armored Cores. The huge flexibility for modification of these mechs with the use of various parts allows players to enhance and sharpen their capabilities.


category : Vehicular combat
‎$59.99

