Assassin's Creed® Mirage

2023
Ubisoft Bordeaux
October 5, 2023
platform: " playstation 4 , playstation 5 , PC , XBOX X ,XBOX S",

Assassin's Creed Mirage is an action-adventure stealth game intended to be reminiscent of older Assassin's Creed titles, being more linear and story-focused and reducing the number of role-playing elements present in recent installments of the series.

category: action-adventure
$49.99
